export const eventsDatabase = () => {
    const eventsStorage = {
        '#atlas': {
            name: 'Atlas Weekend',
            date: '17-06-2023',
            place: 'Київ',
            text: `Atlas (до 2022 року – Atlas Weekend) — один з
            найбільших музичних фестивалів України. Проходить щорічно у Києві в першій половині
            липня в Національному експоцентрі України (ВДНГ). Заснований у 2015 році концертною
            агенцією PMK Event Agency, яка є власником київського нічного клубу Atlas, від якого
            фестиваль і отримав назву. Раніше називався Atlas Weekend, 1 лютого 2022 року
            організатори повідомили про зміну назви на фестиваль Atlas.`,
            img: 'assets/img/modal/atlas.png',
            link: 'https://atlasfestival.com/',
            url: '#atlas',
        },
    
        '#bandershtat': {
            name: 'Bandershtat',
            date: '26-02-2023',
            place: 'Тернопіль',
            text: `«Бандерштат» — всеукраїнський «фестиваль українського духу»,
            що проводиться щоліта на Волині, у місті Луцьку та околицях. Він є артвізитівкою цього краю.
            Вперше проведений 2007 року й відтоді став щорічним.`,
            img: 'assets/img/modal/bandershtat.png',
            link: 'http://bandershtat.org.ua/',
            url: '#bandershtat'
        },
    
        '#woodstock': {
            name: 'Woodstock',
            date: '12-09-2023',
            place: 'Рівне',
            text: `«Вудсток» — один із наймасштабніших і найвизначніших
            в історії рок-фестивалів, символ вільного і мирного співжиття, а також взаємної допомоги 
            величезної кількості споріднених ідеєю людей. У 1995 році для волонтерів польської акції
            «Великий Оркестр Святкової Допомоги» (фундація «WOŚP») було організовано перший польський
            фестиваль під назвою «Зупинка Woodstock» («Przystanek Woodstock»).`,
            img: 'assets/img/modal/woodstock.jpg',
            link: 'https://www.facebook.com/woodstock.in.ua/',
            url: '#woodstock'
        },
    
        '#bulhakovfest': {
            name: 'BulhakovFest',
            date: '12-09-2023',
            place: 'Київ',
            text: `«БулгаковFest» — щорічний фестиваль київської міської культури,
            ініціатором та спонсором якого є Фонд «Культурні Новації» відомого мецената та букініста Влада Трубіцина.
            Метою заходу є збереження та популяризація історичних місць та славетних київських імен, підтримка міської
            культури, запровадження живих та інтерактивних форм вшанування відомих історичних особистостей міста Києва.`,
            img: 'assets/img/modal/bulgakovfest.jpg',
            link: 'https://www.facebook.com/Bulgakovfestkyiv/',
            url: '#bulhakovfest'
        },

        '#artjazz': {
            name: 'Art Jazz',
            date: '24-06-2023',
            place: 'Тернопіль',
            text: `Міжнародний джазовий фестиваль «ART JAZZ» по праву вважається одним з наймасштабніших культурних заходів Волині.
            Почавши свою історію у 2007 році, цей мистецький захід став її своєрідною візитною карткою. Фестиваль об’єднує не лише
            різні жанри мистецтва в темі джазової музики, але й міста. Луцьк і Рівне на деякий час стають центром культурного життя
            та після літа починають фестивальний рух в України.`,
            img: 'assets/img/modal/art-jazz.jpg',
            link: 'http://artjazz.info/',
            url: '#artjazz'
        }, 

        '#docudays': {
            name: 'Docudays UA',
            date: '01-07-02-2023',
            place: 'Київ',
            text: `Найбільший в Україні Міжнародний фестиваль документального кіно про права людини, який відбувається щороку впродовж
            останнього тижня березня у Києві. Після завершення фестивальної програми з жовтня місяця і до кінця року в регіонах
            України традиційно відбуваються покази найкращих фільмів у рамках Мандрівного фестивалю.`,
            img: 'assets/img/modal/docudays.jpg',
            link: 'https://docudays.ua/',
            url: '#docudays'
        }, 

        '#serednyovichnyiHotyn': {
            name: 'Середньовічний Хотин',
            date: '10-14-05-2023',
            place: 'Хотин',
            text: `Протягом чотирьох днів Хотинська фортеця перевтілюється в середньовічне місто. В основному на спеціально
            підготовленій території просто неба проходять лицарські поєдинки. Тут дійсно є безліч речей, на які хочеться дивитися
            постійно. Найбільше гостей вражає джостінг. Він являє собою прийом під час поєдинку, при якому два вершники наносять
            по щитах один одного удари списами, зближуючись при цьому в галопі.`,
            img: 'assets/img/modal/serednyovichnyi_hotyn.jpg',
            link: 'https://www.facebook.com/hotinfest/',
            url: '#serednyovichnyiHotyn'
        }, 

        '#kyivArtWeek': {
            name: 'Kyiv Art Week',
            date: '20-26-05-2023',
            place: 'Київ',
            text: `Головна мета події – розвиток художньої інфраструктури у Східній Європі. Презентації різних галерей,
            що представляють митців на фестивалі, дуже цікаві та інтерактивні. У фестивалі беруть участь відомі київські галереї,
            такі як: Voloshyn Gallery, The Naked Room, Nebo Art Gallery, M17, Abramovich Art, Karas Gallery та багато інших.`,
            img: 'assets/img/modal/kyivArtWeek.jpg',
            link: 'https://kyivartweek.com/',
            url: '#kyivArtWeek'
        }, 

        '#cheeseAndWine': {
            name: 'Cheese & Wine',
            date: '21-23-10-2023',
            place: 'Львів',
            text: `Здавалося б, що поєднує львів’ян із сиром та вином? Однак сьогодні мало хто знає, що чотири століття тому
            клімат у Львові був настільки теплим, що виноградники на південних схилах Високого Замку, Личакова, а потім — на
            пагорбах Кайзервальду, аж до Винників, давали львів'янам щорічно більше сотні бочок вина. Крім цього, львів'яни
            насолоджувалися вишуканим італійським, критським, іспанським та угорським вином, так як Львів був великим торговим центром.`,
            img: 'assets/img/modal/cheese_and_wine.jpg',
            link: 'https://www.facebook.com/CheeseWineFestLviv/',
            url: '#cheeseAndWine'
        }
    };

    return eventsStorage;
}